// STU-MoXer.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#define _CRT_SECURE_NO_WARNINGS 1
#pragma warning(disable : 4996)
// Error	C4996	'itoa': The POSIX name for this item is deprecated.Instead, use the ISO Cand C++ conformant name : _itoa. See online help for details.

#include "MoX_TYPE.H"

#include <STU-Utilities/FC_Array.H>

#include <iostream>     /* ? */

#include <windows.h>

/*

HRESULT     windows.h   winnt.h
LPCWSTR     windows.h   winnt.h
LPBYTE      windows.h   minwindef.h
DWORD       windows.h   minwindef.h

_tprintf    tchar.h

GetLastError()  errhandlingapi.h

*/


// #include ""FC_Array.H"
// #include <STU-Utilities/STU-Utilities.hpp>
#include <STU-Utilities/FC_File_WinAPI.hpp>



/*
    Manifest Constants for Unit Types
    Character Arrays for Unit Type Names
    Array of Pointers to Character Arrays for Unit Type Names
    Unit Type Structures for Unit Types
    Array of Unit Type Structures for Unit Types

*/

/*
    Manifest Constants for Unit Types

    FIGURES__.LBX
    16 files
    1728 entries
    8 entries per unit type
    216 distinct entry names
    ? duplicates ? e.g., DJINN3, SKYDRAKE

*/

// sizeof: 20h  32d
struct s_LBX_STR_TBL_REC
{
    char name[9];
    char description[23];
};

// sizeof: 24h  36d
struct s_UNIT_TYPE
{
    /* 00 */ uint16_t Name;                   /* ; offset (00036AA0) */
    /* 02 */ int8_t Melee;                  /* ; base 10 */
    /* 03 */ int8_t Ranged;                 /* ; base 10 */
    /* 04 */ int8_t Ranged_Type;
    /* 05 */ int8_t Ammo;                   /* ; base 10 */
    /* 06 */ int8_t To_Hit;                 /* ; base 10 */
    /* 07 */ int8_t Defense;                /* ; base 10 */
    /* 08 */ int8_t Resist;                 /* ; base 10 */
    /* 09 */ int8_t Move_Halves;            /* ; base 10 */
    /* 0A */ int16_t Cost;                  /* ; base 10 */
    /* 0C */ int8_t Upkeep;                 /* ; base 10 */
    /* 0D */ int8_t Race;                   /* ; enum Race_Code */
    /* 0E */ int8_t Bldng1_or_Portrait;     /* ; enum BLD_TYPE */
    /* 0F */ int8_t Bldng2_or_HeroType;     /* ; enum BLD_TYPE */
    // /* 10 */ SAMB_ptr pict_seg;             /* ; segment pointers to LBX_Alloc_Space headers for reserved EMM file links */
    /* 10 */ uint16_t pict_seg;
    /* 12 */ int8_t Hits;                   /* ; base 10 */
    /* 13 */ int8_t Sight;                  /* ; base 10 */
    /* 14 */ int8_t Transport;              /* ; base 10 */
    /* 15 */ int8_t Figures;                /* ; base 10 */
    /* 16 */ int8_t Construction;           /* ; base 10 */
    /* 17 */ int8_t Spec_Att_Attr;          /* ; base 10 */
    /* 18 */ uint16_t Move_Flags;            /* ; bitfield enum MOVEFLAGS */
    /* 1A */ uint16_t Attribs_1;             /* ; bitfield enum ATTRIB_1 */
    /* 1C */ uint16_t Attribs_2;             /* ; bitfield enum ATTRIB_2 */
    /* 1E */ uint16_t Abilities;             /* ; bitfield enum ABL_FLAGS */
    /* 20 */ uint16_t Attack_Flags;          /* ; bitfield enum ATK_FLAGS */
    /* 22 */ int16_t Sound;
};

struct s_UNIT_TYPE* mom_unit_types;

// Unit Type Records / Structure Definitions
#define UNIT_TYPE_STRUCTURE_COUNT 198
uint16_t unit_type_structures_ofst = 0x019C;  // Offset from DSEG in WIZARDS.EXE
uint8_t * _unit_types_structures;
char szUnitTypeStructures[65536];

// Unit Type Names
#define UNIT_TYPE_NAME_COUNT 120
uint16_t unit_type_name_ofst = 0x21D3;  // Offset from DSEG in WIZARDS.EXE
uint8_t * _unit_types_names;
char szUnitTypeNames[65536];

struct s_UNIT_TYPE_NAME_OFFSET
{
    uint16_t ofst;
    uint16_t idx;
};
struct s_UNIT_TYPE_NAME_OFFSET _unit_type_names_offsets[UNIT_TYPE_NAME_COUNT];

// Unit Type Manifest Constants / Abbreviations
char _figures_names[1728][9];
char _distinct_figures_names[216][9];




WCHAR szFileName[MAX_PATH] = L"WZD_DSEG.BIN";

WCHAR szFiguresFileName_01[MAX_PATH] = L"FIGURES1.LBX";
WCHAR szFiguresFileName_02[MAX_PATH] = L"FIGURES2.LBX";
WCHAR szFiguresFileName_03[MAX_PATH] = L"FIGURES3.LBX";
